//------------------------------------------------------------
// @file		mouse.cpp
// @brief	入力 / マウス
//------------------------------------------------------------
#include "mouse.h"

//=============================================================
// 初期化
//=============================================================
bool InputMouse::Init(HINSTANCE hInstance, HWND hwnd)
{
	return true;
}

//=============================================================
// 終了
//=============================================================
void InputMouse::Uninit()
{
}

//=============================================================
// 更新
//=============================================================
void InputMouse::Update()
{
	m_mouseState[0] = GetKeyState(VK_LBUTTON) & 0x80;
	m_mouseState[1] = GetKeyState(VK_RBUTTON) & 0x80;
	m_mouseState[2] = GetKeyState(VK_MBUTTON) & 0x80;
}

//=============================================================
// 入力情報の取得
//=============================================================
bool InputMouse::GetKey(KeyCode keycode)
{
	for (int i = 0; i < _countof(mouseTable); i++)
	{
		if (mouseTable[i].key == keycode)
		{ // キーコードが一致するとき
			return m_mouseState[i];
		}
	}
	return false;
}
