//------------------------------------------------------------
// @file		manager.cpp
// @brief	マネージャー
// @detail	システムの管理を行います
//------------------------------------------------------------
#include "manager.h"

//=============================================================
// 初期化
//=============================================================
void Manager::Init(HINSTANCE hInstance, HWND hWnd)
{
	// レンダラーを生成する
	m_renderer = new Renderer();
	m_renderer->Init(hInstance, hWnd);

	GameObject* test = new GameObject();
}

//=============================================================
// 終了
//=============================================================
void Manager::Uninit()
{
	// レンダラーを終了する
	if (m_renderer != nullptr)
	{
		m_renderer->Uninit();
		delete m_renderer;
		m_renderer = nullptr;
	}

	// すべてのオブジェクトを破棄する
	Object::AllDestroy();

#if OUTPUT_LOG_FILE
	// ログを書き出す
	Log::outputLog();
#endif
}

//=============================================================
// 更新
//=============================================================
void Manager::Update()
{
	// ゲームオブジェクトを更新する
	GameObject::AllUpdate();

	// レンダラーを更新する
	m_renderer->Update();
}

//=============================================================
// 描画
//=============================================================
void Manager::Draw()
{
	// レンダラーを描画する
	m_renderer->Draw();
}
