//------------------------------------------------------------
// @file		component.cpp
// @brief	コンポーネント
//------------------------------------------------------------
#include "component.h"

//=============================================================
// ゲームオブジェクトにアタッチする
//=============================================================
void Component::AttachGameObject(GameObject* attachObj)
{
	if (!m_attached)
	{ // アタッチされていないとき
		gameObject = attachObj;
		transform = gameObject->transform;
		m_attached = true;
	}
}

//=============================================================
// 解放する
//=============================================================
void Component::Release()
{
	// 終了処理を行う
	this->Uninit();
}
